import random

def GetDate(date):
    days = {
        1 : "первого",
        2 : "воторого",
        3 : "третьего",
        4 : "четвертого",
        5 : "пятого",
        6 : "шестого",
        7 : "седьмого",
        8 : "восьмого",
        9 : "девятого",
        10 : "десятого",
        11 : "одинадцатого",
        12 : "двенадцатого",
        13 : "тринадцатого",
        14 : "четырнадцатого",
        15 : "пятнадцатого",
        16 : "шетнадцатого",
        17 : "семнадцатого",
        18 : "восемьнадцатого",
        19 : "девятнадцатого",
        20 : "двадцатоого",
        30 : "тридцатого",
        31 : "тридцать первого"
    }

    months = {
        12: "Декабря", 1: "Января", 2: "Февраля",
        3: "Марта", 4: "Апреля", 5: "Мая",
        6: "Июня", 7: "Июля", 8: "Августа",
        9: "Сентября", 10: "Октября", 11: "Ноября"
    }

    x = list(map(int,date.split(".")))

    if days.__contains__(x[0]):
        date_string = days[x[0]]
    else:
        date_string = "двадцать "+days[x[0]%10]

    date_string += f" {months[x[1]]} {x[2]} года"

    return date_string

birth_days = {"Наполеон Бонапарт": "15.08.1769",
             "Мадонна": "16.08.1958",
             "Леонардо да Винчи" : "15.04.1452",
             "Юрий Гагарин" : "09.03.1934",
             "Пётр I" : "09.06.1672",
             "Иосиф Сталин" : "18.12.1878",
             "Гюстав Эйфель" : "15.12.1832",
             "Никола Тесла" : "10.07.1856",
             "Генри Фрод" : "30.07.1863",
             "Галилео Галилей" : "15.02.1564"}

while True:
    questions = random.sample(list(birth_days.keys()), 5)
    correctAnswers = 0
    for question in questions:
        date = input(f"Когда родился {question}?")
        if date == birth_days[question]:
            correctAnswers += 1
            print("Верно.")
        else:
            print(f"Неверно. {question} родился {GetDate(birth_days[question])}")


    print(f"Верных ответов: {correctAnswers}")
    print(f"Ошибок: {5 - correctAnswers}")
    print(f"% верных ответов: {correctAnswers*20}%")
    print(f"% ошибок: {100 - correctAnswers*20}%")
    repeat = input("Начать игру сначала? ")
    if repeat != "да":
        break